{
  "testimonials": [
    {
      "id": "hyppolite-1",
      "quote": "This book is truly amazing. The story is filled with mystery, drawing you in, allowing you to connect deeply with each individual as they evolve throughout the story. The main character is excellent also, and the author keeps you engaged in every chapter. I really love the book! Great work!",
      "author": "Nedjyna Hyppolite",
      "type": "review"
    },
    {
      "id": "butwin-1",
      "quote": "Sentinel's Dilemma reads like a smart blend of science fiction, political thriller, and slow-burn character drama. From the opening chapters, it's clear that George Gerstner isn't just interested in aliens-on-Earth spectacle, but in the tension that comes from secrecy, loyalty, and moral restraint. Lieutenant Antel Ralnar is a compelling protagonist, disciplined, observant, and clearly shaped by a rigid military culture, yet deeply human in the way he struggles with uncertainty and emotional attachment. Watching him navigate Earth's political complexity while constantly filtering everything through the constraints of the Standard Protocol gives the story a persistent, believable pressure.\n\nWhat stood out most to me was how grounded the Earth-based elements felt. The political intrigue unfolds gradually, and while the conspiracy itself is dangerous, it's Antel's limited perspective that makes it gripping. As a reader, you feel his frustration at being unable to act openly or explain himself, especially as the stakes rise. The relationship with Becky could have easily become a distraction, but instead it works as an emotional anchor. Their interactions are written with restraint, which fits Antel's character, and the conflict between duty and honesty is handled thoughtfully rather than melodramatically.\n\nBy the final act, the novel successfully balances its personal and global stakes. The tension doesn't come from flashy action alone, but from the consequences of choice, what Antel is willing to sacrifice, and what he refuses to compromise. Gerstner leaves you thinking not just about the fate of the mission, but about identity and responsibility in a world where truth itself can be dangerous. Sentinel's Dilemma is a solid, character-driven sci-fi novel that rewards patience and pays off emotionally, making it a memorable read long after the last page.",
      "author": "Susan Butwin",
      "type": "review"
    }
  ]
}